/* No comment provided by engineer. */
"Set Cyberduck as default application for FTP and SFTP locations?" = "Setez Cyberduck ca aplicație implicită pentru adrese de tip FTP și SFTP?";

/* No comment provided by engineer. */
"As the default application, Cyberduck will open when you click on FTP or SFTP links in other applications, such as your web browser. You can change this setting in the Preferences later." = "Ca aplicație implicită, Cyberduck se va deschide de câte ori vei face click pe link-uri FTP sau SFTP din alte aplicații, cum ar fi de exemplu browser-ul web. Poti modifica această setare oricând din Preferințe.";

/* Apply proposed action. */
"Change" = "Schimbă";

/* Do not display this dialog again. */
"Don't Ask Again" = "Nu mai întreba din nou";

/* Don't change anything. */
"Cancel" = "Anulare";